IDENTIFICATION DIVISION.
PROGRAM-ID. ESCRITASEQ.
ENVIRONMENT DIVISION.
INPUT-OUTPUT DIVISION.
FILE-CONTROL.
      SELECT ARQESTUDANTES ASSIGN TO "ESTUDANTES.DAT"
           ORGANIZATION IS LINE SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD ARQESTUDANTES
01 DADOSESTUDANTE.
      02   ESTUDANTEID    PIC 9(7)
      02   ESTUDANTENOME.
           03 PRINOME     PIC X(8).
           03 INICIAIS    PIC XX.
      02 GENERO           PIC X.
PROCEDURE DIVISION.
INICIO.
    OPEN OUTPUT ARQESTUDANTES
    DISPLAY "Digite os dados do estudante conforme exemplo ou <enter> para terminar"
    PERFORM OBTER-DETALHES-ESTUDANTE
    PERFORM UNTIL DADOSESTUDANTE = SPACES
       WRITE DADOS ESTUDANTE
       PERFORM OBTER-DETALHES-ESTUDANTE
    END-PERFORM
    CLOSE ARQESTUDANTES
    STOP RUN.
OBTER-DETALHES-ESTUDANTE.
    DISPLAY "Digite - id, primeiro nome, iniciais, genero"
    ACCEPT DADOSESTUDANTE.