IDENTIFICATION DIVISION.
PROGRAM-ID. IND-SQL.

DATA DIVISION.
WORKING-STORAGE SECTION.
EXEC SQL
INCLUDE SQLCA
END-EXEC
EXEC SQL
INCLUDE STUDANTE
END-EXEC
EXEC SQL BEGIN DECLARE SECTION
END-EXEC.
    01 WS-ESTUDANTE-REC.
        05 WS-ESTUDANTE-ID PIC 9(4)
        05 WS-ESTUDANTE-NOME PIC X(25)
        05 WS-ESTUDANTE-ENDERECO X(50)
EXEC SQL END DECLARE SECTION
END-EXEC.

PROCEDURE DEVISION.
MOVE 1005 TO WS-ESTUDANTE-ID.
MOVE 'Paulo' TO WS-ESTUDANTE-NOME.
MOVE 'Brasilia' TO WS-ESTUDANTE-ENDERECO.
EXEC SQL
    INSERT INTO ESTUDANTE(ESTUDANTE-D, ESTUDANTE-NOME, ESTUDANTE-ENDERECO)
    VALUES (:WS-ESTUDANTE-ID, :WS-ESTUDANTE-NOME, :WS-ESTUDANTE-ENDERECO)
END-EXEC.
IF SQLCODE = 0
    DISPLAY 'Registro inserido com sucesso!'
    DISPLAY WS-ESTUDANTE-REC
ELSE DISPLAY 'Erro'
END-IF.
STOP RUN.